sm110(icelake)_not_consolidated_4core_4iothread_1/multiplier_8/run1.txt
# run=1/10
# 2026-04-06T01:38:17-05:00
# cmd: taskset -c 1-31 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            735378
        write:                           190946
        other:                           98068
        total:                           1024392
    transactions:                        45541  (758.56 per sec.)
    queries:                             1024392 (17062.91 per sec.)
    ignored errors:                      6986   (116.36 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      758.5591
    time elapsed:                        60.0362s
    total number of events:              45541

Latency (ms):
         min:                                    1.97
         avg:                                   42.17
         max:                                  270.89
         95th percentile:                       89.16
         sum:                              1920488.57

Threads fairness:
    events (avg/stddev):           1423.1562/17.85
    execution time (avg/stddev):   60.0153/0.01